local function run (msg , matches)
if matches[1]:lower() == "fun help" or matches[1] == 'راهنما فان' and is_mod(msg) then
if not lang then
text = [[

🔘_SkY.دستورات سرگرمی:_

◾️*!time*
◾️*ساعت*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!short* `[link]`
◾️*لینک کوتاه* `[لینک]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!voice* `[text]`
◾️*تبدیل به صدا* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tr* `[lang] [word]`
◾️*ترجمه* `[زبان] [کلمه]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!sticker* `[word]`
◾️*استیکر* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!photo* `[word]`
◾️*عکس* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!calc* `[number]`
◾️*ماشین حساب* `[معادله]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!praytime* `[city]`
◾️*ساعات شرعی* `[شهر]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tosticker* `[reply]`
◾️*تبدیل به استیکر* `[ریپلی]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tophoto* `[reply]`
◾️*تبدیل به عکس* `[ریپلی]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!weather* `[city]`
◾️*اب و هوا* `[شهر]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘*شما میتوانید از [!/#] در اول دستورات برای اجرای آنها بهره بگیرید*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘_You can use_ *[!/#]* _at the beginning of commands._
🌐 @SkYTeaM 🌐 ;)]]

elseif lang then

text = [[

🔘_SkY.دستورات سرگرمی:_

◾️*!time*
◾️*ساعت*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!short* `[link]`
◾️*لینک کوتاه* `[لینک]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!voice* `[text]`
◾️*تبدیل به صدا* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tr* `[lang] [word]`
◾️*ترجمه* `[زبان] [کلمه]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!sticker* `[word]`
◾️*استیکر* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!photo* `[word]`
◾️*عکس* `[متن]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!calc* `[number]`
◾️*ماشین حساب* `[معادله]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!praytime* `[city]`
◾️*ساعات شرعی* `[شهر]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tosticker* `[reply]`
◾️*تبدیل به استیکر* `[ریپلی]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!tophoto* `[reply]`
◾️*تبدیل به عکس* `[ریپلی]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
◾️*!weather* `[city]`
◾️*اب و هوا* `[شهر]`
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘*شما میتوانید از [!/#] در اول دستورات برای اجرای آنها بهره بگیرید*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘_You can use_ *[!/#]* _at the beginning of commands._
🌐 @SkYTeaM 🌐 ;)]]
end
return text
end
------------------------------------------
if matches[1] == "rahnama" or  matches[1] == "راهنما" and is_mod(msg) then
if not lang then
text = [[

💾_راهنمای ربات sky:_

!helpfa | دستورات مدیریتی
🔏_مشاهده دستورات فارسی ربات😶_
~~~~~~~~~~~~~~~~~~~
!help 
🚬_مشاهده دستورات انگلیسی ربات_
~~~~~~~~~~~~~~~~~~~~
!fun help | راهنما فان
🏃_مشاهده دستورات فان_
~~~~~~~~~~~~~~~~
🔘*شما میتوانید از [!/#] در اول دستورات برای اجرای آنها بهره بگیرید*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘_You can use_ *[!/#]* _at the beginning of commands._
@skyteam;)]]
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
else

text = [[

💾_راهنمای ربات sky:_

!helpfa | دستورات مدیریتی
🔏_مشاهده دستورات فارسی ربات😶_
~~~~~~~~~~~~~~~~~~~
!help 
🚬_مشاهده دستورات انگلیسی ربات_
~~~~~~~~~~~~~~~~~~~~
!fun help | راهنما فان
🏃_مشاهده دستورات فان_
~~~~~~~~~~~~~~~~~
🔘*شما میتوانید از [!/#] در اول دستورات برای اجرای آنها بهره بگیرید*
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🔘_You can use_ *[!/#]* _at the beginning of commands._
📩@skyteam📩 ;)]]
end
return text
end
----------------------------------------------
if matches[1] == "helpfarsi" or  matches[1] == "دستورات مدیریتی" and is_mod(msg) then
if not lang then
text = [[

🔘_SkY.دستورات مدیریتی:_

ایدی
_نمایش ایدی شما_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
سنجاق پیام
_سنجاق کردن یک پیام درگروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف سنجاق
_حذف پیام سنجاق شده_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
صاحب گروه [ایدی|ریپلای|یوزرنیم]
_تنظیم اونر گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف صاحب گروه [ایدی|ریپلای|یوزرنیم]
_حذف اونر ازمقام خود_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
کمک مدیر[ایدی|ریپلای|یوزرنیم]
_کمک مدیر کردن یک شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف کمک مدیر[ایدی|ریپلای|یوزرنیم]
_تنزل مقام یک کمک مدیر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
فیلتر[کلمه]
_اضافه کردن کلمه به لیست کلمات ممنوع_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف فیلتر [کلمه]
_در اوردن کلمه از لیست کلمات ممنوع_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست فیلتر
_نمایش کلمات ممنوع_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
قفل | لینک | فراخانی | تگ | ادیت | فونت | اسپم | فلود | ربات | سایت
_قفل کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
بازکردن | لینک | فراخانی | تگ | ادیت | فونت | اسپم | فلود | ربات | سایت
_بازکرن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
بیصدا کردن | همه | گیف | متن | عکس | ویدیو | صدا | ویس | استیکر | مخاطب | فوروارد | مکان | فایل | سرویس تلگرام | دکمه شیشه ای | بازی
_بیصدا کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
باصدا کردن | همه | گیف | متن | عکس | ویدیو | صدا | ویس | استیکر | مخاطب | فوروارد | مکان | فایل | سرویس تلگرام | دکمه شیشه ای | بازی
_باصدا کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
مسدود
_مسدود کامل کاربر از گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رفع مسدود
_برای رفع مسدودیت کاربر از گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
سایلنت
_برای گرفتن توانایی چت کردن کاربر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رفع سایلنت
_به دست اوردن توانایی چت کردن کاربر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست سایلت
_نمایش لیست افراد که توانایی چت کردن را از دست داده اند_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست مسدود
_نمایش لیست افرادی که از گروه محروم شده اند_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
اطلاعات گروه
_نمایش اطلاعات گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم لینک
_تنظیم لینک گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لینک
_نمایش لینک گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم قوانین [متن]
_تنظیم متن قوانین_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
قوانین
_نمایش قوانین گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رس [یوزرنیم]
_نمایش اطلاعات شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
چه کسی [ایدی]
_نمایش اطلاعات شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم فلود *[1-50]* 
_تنظیم فلود گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
پاک کردن | کمک مدیر | قوانین | درباره گروه | صاحب گروه
_پاک کردن دیتاهای بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم نام [نام]
_تنظیم نام گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم درباره [متن]
_تنظیم درباره موضوع گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
درباره گروه
_نمایش درباره گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیمات
_نمایش تنظیمات_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست بیصداها
_نمایش لیست بیصدا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست کمک مدیران
_نمایش کمک مدیران گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست صاحب گروه
_نمایش لیست اونر های گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم زبان | فارسی | انگلیسی
_تنظیم زبان ربات_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
راهنما
_نمایش راهنما_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم ولکام [متن]
_تنظیم پیام خوش آمدگویی_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف ولکام
_پاک کردن ولکام_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
راهنما فان
_برای دیدن دستورات سرگرمی و فان_
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
_ باتشکر موفق باشید :)_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🌐 @SkYTeaM 🌐 ;)]]
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
else

text = [[
🔘_SkY.دستورات مدیریتی:_

ایدی
_نمایش ایدی شما_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
سنجاق پیام
_سنجاق کردن یک پیام درگروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف سنجاق
_حذف پیام سنجاق شده_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
صاحب گروه [ایدی|ریپلای|یوزرنیم]
_تنظیم اونر گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف صاحب گروه [ایدی|ریپلای|یوزرنیم]
_حذف اونر ازمقام خود_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
کمک مدیر[ایدی|ریپلای|یوزرنیم]
_کمک مدیر کردن یک شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف کمک مدیر[ایدی|ریپلای|یوزرنیم]
_تنزل مقام یک کمک مدیر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
فیلتر[کلمه]
_اضافه کردن کلمه به لیست کلمات_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف فیلتر [کلمه]
_در اوردن کلمه از لیست کلمات ممنوع_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست فیلتر
_نمایش کلمات ممنوع_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
قفل | لینک | فراخانی | تگ | ادیت | فونت | اسپم | فلود | ربات | سایت
_قفل کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
بازکردن | لینک | فراخانی | تگ | ادیت | فونت | اسپم | فلود | ربات | سایت
_بازکرن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
بیصدا کردن | همه | گیف | متن | عکس | ویدیو | صدا | ویس | استیکر | مخاطب | فوروارد | مکان | فایل | سرویس تلگرام | دکمه شیشه ای | بازی
_بیصدا کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
باصدا کردن | همه | گیف | متن | عکس | ویدیو | صدا | ویس | استیکر | مخاطب | فوروارد | مکان | فایل | سرویس تلگرام | دکمه شیشه ای | بازی
_باصدا کردن تمامی امکانات بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
مسدود
_مسدود کامل کاربر از گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رفع مسدود
_برای رفع مسدودیت کاربر از گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
سایلنت
_برای گرفتن توانایی چت کردن کاربر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رفع سایلنت
_به دست اوردن توانایی چت کردن کاربر_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست سایلت
_نمایش لیست افراد که توانایی چت کردن را از دست داده اند_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست مسدود
_نمایش لیست افرادی که از گروه محروم شده اند_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
اطلاعات گروه
_نمایش اطلاعات گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم لینک
_تنظیم لینک گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لینک
_نمایش لینک گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم قوانین [متن]
_تنظیم متن قوانین_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
قوانین
_نمایش قوانین گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
رس [یوزرنیم]
_نمایش اطلاعات شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
چه کسی [ایدی]
_نمایش اطلاعات شخص_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم فلود *[1-50]* 
_تنظیم فلود گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
پاک کردن | کمک مدیر | قوانین | درباره گروه | صاحب گروه
_پاک کردن دیتاهای بالا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم نام [نام]
_تنظیم نام گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم درباره [متن]
_تنظیم درباره موضوع گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
درباره گروه
_نمایش درباره گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیمات
_نمایش تنظیمات_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست بیصداها
_نمایش لیست بیصدا_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست کمک مدیران
_نمایش کمک مدیران گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
لیست صاحب گروه
_نمایش لیست اونر های گروه_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم زبان | فارسی | انگلیسی
_تنظیم زبان ربات_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
راهنما
_نمایش راهنما_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
تنظیم ولکام [متن]
_تنظیم پیام خوش آمدگویی_
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
حذف ولکام
_پاک کردن ولکام_
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
راهنما فان
_برای دیدن دستورات سرگرمی و فان_
﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
_ باتشکر موفق باشید :)_  
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
🌐 @SkYTeaM 🌐 ;)]]
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
end
end
end

return {
patterns ={
"^[!/#](helpfarsi)$",
"^[!/#](rahnama)$",
"^[!/#](fun help)$",
"^(دستورات مدیریتی)$",
"^(راهنما)$",
"^(راهنما فان)$",

}, 
run =run
}
